(package! paradox)
(package! beginend)
(package! visual-regexp-steroids)
(package! visual-regexp)
(package! sort-words)
(package! comment-dwim-2)
(package! ace-isearch)
(package! smart-backspace)
(package! proced)
(package! mwim)
(package! open-junk-file)
(package! winum)
(package! winner)
(package! deadgrep)
(package! fill-column-indicator)
(package! expand-region)
(package! insert-shebang)
(package! crux)
(package! dash-at-point)
(package! helm-dash)
