
(package! magit)
(package! magit-imerge)
(package! gitattributes-mode)
(package! gitconfig-mode)
(package! gitignore-mode)
(package! git-commit)
(package! git-link)
(package! git-messenger)
(package! git-timemachine)
(package! magit-todos)
(package! rigid-tabs)
(package! helm-gitignore)
